---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticConstruction
source: html/905f6fcb-541a-d7b9-6240-a8283e717a12.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticConstruction Property

"Analytic Construction"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticConstruction { get; }
```